{
  "nameUniversity": "ITSTEP University Repository",
  "findPlaceholder": "Search for material",
  "enter" : "Enter",
  "pages": {
    "mainPage": "Main",
    "anaLyticPage": "Analytics",
    "userManagePage": "User management",
    "downloadPage": "Download material",
    "manageDisciplinePage": "Management of disciplines",
    "manageGroupPage": "Group management"
  },
  "material": {
    "sortByDiscipline": "Selection of Discipline",
    "chooseAuthor": "Choose Author",
    "sortByMaterial": "Selection of material type",
    "clearSearch": "Clear Search Options",
    "deleteMessage": "You are sure you want to delete",
    "deleteYes": "Yes",
    "deleteNo": "No",
    "deleteWhatAnalytic": "material",
    "buttonDownloadMaterial": "Download Material",
    "buttonSaveChanges": "Save Changes",
    "buttonDeleteMaterial": "Delete",
    "succesDelete": "Successfully deleted",
    "materialName" : "Name:",
    "materialDescription" : "Description:",
    "materialDiscipline" : "Discipline:",
    "materialTypematerial" : "Material Type:",
    "materialAuthor" : "Author:",
    "materialCountViewers" : "Number of views:",
    "materialDateUpload" : "Upload Date:"
  },
  "userManage": {
    "sortByGroup": "Select Group",
    "student": "Users",
    "author": "Authors",
    "addAuthor": "Add Author",
    "addStudent": "Add User",
    "titleAddStudent": "Added User",
    "fullName": "fullName",
    "login": "Login",
    "password": "Password",
    "buttonSave": "Save",
    "buttonCancel": "Cancel",
    "buttonDeleteStudent": "Delete User",
    "deleteWhatStudent": "user",
    "group": "Group ▼",
    "addGroup": "Add Group",
    "discipline": "Disciplines ▼",
    "addDiscipline": "Add Discipline",
    "buttonDeleteAuthor": "Delete author",
    "position": "Position/Title",
    "addedDisciplines": "Added disciplines:",
    "selectedDiscipline": "Selected disciplines:"
  },
  "materialAdd": {
    "nameMaterial": "Enter a name",
    "requieridName": "Name is required",
    "desctipMaterial": "Enter description:",
    "requieridDesctip": "Description is required",
    "addLink": "Insert link:",
    "touchFile": " Drag the file",
    "sizeFile": "*File size must not exceed 100 MB.",
    "sizaImage" : "*The file size must not exceed 10 MB.",
    "addFile": "Upload File",
    "link": "Link?",
    "touchImage": "Drag Cover",
    "addImage": "Upload cover art",
    "addMaterial": "Add",
    "clearAll": " Cancel",
    "reset": "Material successfully canceled",
    "reqParams": "Material cannot be added without file or cover"
  },
  "disciplinesManage": {
    "deleteDiscipline": "discipline",
    "deleteDisciplineDescr": "All existing disciplines will be deleted",
    "buttonDeleteDiscipline": "Delete Discipline",
    "addDiscipline": "Add Discipline",
    "nameDiscipline": "Name of Discipline",
    "selectedGroup": "Selected groups:",
    "succesAdd": "Discipline successfully created",
    "titleAddDiscipline": "Add Group to Discipline"
  },
  "groupManage": {
    "succesAdd": "Successfully added",
    "nameDel": "group",
    "groupDescr": "All existing connections will be removed",
    "deleteGroup": "Delete Group",
    "nameGroup": "Group name",
    "choose": "Not selected"
  },
  "headerStudent": {
    "burgerMaterials": "Materials",
    "burgerAbout": "University Information"
  },
  "aboutPage": {
    "history": "HISTORY",
    "history_text_1": "Lviv occupies a significant place in terms of the number of IT specialists in Ukraine. Today, there are more than 370 IT companies operating in the city, which have attracted more than 16,000 employees to their activities, and this indicator is constantly increasing. It is expected that by 2025, the number of IT specialists will double. All this indicates that the IT industry has a huge potential, that there is a significant demand for IT specialists and a high probability of employment.",
    "history_text_2": "Successful functioning of the IT industry gave impetus to the development and implementation of various innovative projects. Including in the field of education.",
    "history_text_3": "The business activities of companies on the global world market, on the one hand, and the high demand for professionals with various IT qualifications, on the other hand, impose demands on educational projects for flexibility, updating, mobility and transparency. Understanding these requirements and the possibility of meeting them have become the main factors in the process of creating the IT university 'ITSTEP University' .",
    "university": "ITSTEP University",
    "universityText_1": "Understanding the importance of quality education, both in the context of an individual and in the context of the development of the state, the university arose as a result of the evolutionary development of the Computer Academy 'STEP'. In December 2018, the Academy received a license from the Ministry of Education and of Sciences of Ukraine (Order of the Ministry of Education and Culture No. 3073-l dated 21.12.2018), therefore IT STEP ACADEMY becomes an institution of higher education in the IT direction.",
    "universityText_2": "In July 2019, the admissions campaign to higher education institutions started, and ITSTEP University showed successful statistics.",
    "universityText_3": "On September 1, 2019, the first solemn dedication to the students of the University took place.",
    "universityText_4": "Also in September 2019, students of the pre-university training program, which was designed specifically for students who want to connect their future with the IT field, began their studies.",
    "universityText_5": "In 2021, ITSTEP is undergoing relicensing, Order of the Ministry of Education and Culture No. 2-l dated January 14, 2021, with a licensed volume of 220 places per year.",
    "universityText_6": "ITSTEP is an authorized center of Microsoft, Cisco companies, thanks to which university students can receive international certificates from world industry leaders during their studies.",
    "universityText_7": "In addition, the university joins the IT Community regional union and, together with leading specialists in the IT industry, creates modern programs, shapes the image of IT specialists for IT companies, becomes a co-organizer of important events in the IT industry and the social sphere.",
    "acadaemyUniversity": "IT STEP Computer Academy",
    "acadaemyUniversityText_1": "An international educational institution specializing in IT education. The Academy has three key areas of study: software development, networks and cyber security, computer graphics and design. There is also a separate division - the Small Computer Academy , where children from 8 to 15 years old study.",
    "geography": "Geography",
    "geographyText_1": "Today there are 166 branches of IT STEP Computer Academy in 22 countries of the world on 4 continents (Europe, Asia, South and North America).",
    "mission": "Mission of the University",
    "missionText_1": "Development of a personality capable of independent thinking and creative intellectual search, with a broad outlook and motivation for self-improvement through learning, research and collaboration.",
    "vision": "Vision of the University",
    "visionText_1": "Dnipro University of Technology 'SHAG' is a modern institution in the system of higher education, which carries out scientific research and educational activities in the field of computer sciences and information technologies at a modern level, develops and implements innovative research projects, provides relevant consultations on local and national levels, promotes internationalization and academic integrity, respects the opinion and suggestions of employees and students, professes transparency in institutional management, as well as openness to the needs of society.",
    "ourVision": "Our visions",
    "ourVisionText_1": "We are creating a new generation of highly capable citizens who will build the future.",
    "ourVisionText_2": "We are a single team that believes in trust, collaboration and connection through learning around the world.",
    "ourVisionText_3": "We are aware of our responsibility for shaping a successful future human life.",
    "ourVisionText_4": "We respect diversity. We value the spiritual world and emotional intelligence of each person, realizing that respect for the individual, empowerment of each other allows our students to discover and realize their potential.",
    "ourVisionText_5": "We demand excellence. We formulate the highest quality standards of university activity and demand their provision both for ourselves and for our students.",
    "ourVisionText_6": "We know that there is no innovation without risk. New ideas provoke new ways of thinking, remove excess and ensure our innovative development."
  }
}
